{
	"Mindfulness & Reflection": [
		{
			"id": "morning_sun_greeting",
			"title": "Morning Sun Greeting",
			"color": "#FFC09F",
			"description": "Start your day with sunlight exposure. Step outside or sit by a window to soak in the morning sun."
		},
		{
			"id": "candle_gazing",
			"title": "Candle Gazing",
			"color": "#FFECB3",
			"description": "Meditate while watching a candle flame. Sit in stillness, observe the flickering light, and breathe deeply."
		},
		{
			"id": "sunset_reflection",
			"title": "Sunset Reflection",
			"color": "#FFB28C",
			"description": "Watch the sunset and reflect on your day. Take a few moments to observe the sunset and appreciate what went well today."
		},
		{
			"id": "journaling",
			"title": "Journaling",
			"color": "#EACF8F",
			"description": "Write down your thoughts and reflections. Capture your feelings, gratitude, and daily events in a journal."
		},
		{
			"id": "reading_philosophy",
			"title": "Reading Philosophy",
			"color": "#CCAA99",
			"description": "Expand your mind with deep thinking. Read an insightful philosophical book or passage."
		},
		{
			"id": "gratitude_list",
			"title": "Gratitude List",
			"color": "#E7D7C4",
			"description": "List things you're grateful for. Spend a few minutes each day noting things that bring you joy or for which you are thankful."
		},
		{
			"id": "silent_meditation",
			"title": "Silent Meditation",
			"color": "#E0C69C",
			"description": "Practice stillness and observe your breath. Find a quiet space, close your eyes, and focus on your breath without judgment."
		},
		{
			"id": "mindful_eating",
			"title": "Mindful Eating",
			"color": "#D4B78A",
			"description": "Savor your meals with full attention. Eat slowly, notice the flavors, textures, and smells of your food, and appreciate each bite."
		},
		{
			"id": "digital_detox_hour",
			"title": "Digital Detox Hour",
			"color": "#FFC7A8",
			"description": "Unplug from screens for an hour. Dedicate one hour to activities without digital devices to reduce screen time and recharge."
		},
		{
			"id": "deep_listening",
			"title": "Deep Listening",
			"color": "#E7B8A8",
			"description": "Practice truly listening to others or nature. Engage fully in a conversation without interrupting, or sit quietly and listen to sounds around you."
		}
	],
	"Physical Health & Wellness": [
		{
			"id": "daily_hydration",
			"title": "Daily Hydration",
			"color": "#FFB7A9",
			"description": "Drink 8 glasses of water throughout the day. Stay hydrated by pacing your water intake—aim for a glass every 2 hours."
		},
		{
			"id": "stretching_routine",
			"title": "Stretching Routine",
			"color": "#FFC98C",
			"description": "Ease tension with gentle stretches. Move through slow stretches to relax muscles and improve flexibility."
		},
		{
			"id": "deep_breathing",
			"title": "Deep Breathing",
			"color": "#FFE0BF",
			"description": "Practice mindful breathing. Inhale slowly, hold, and exhale fully to bring calmness to your body."
		},
		{
			"id": "herbal_tea_break",
			"title": "Herbal Tea Break",
			"color": "#DBD5AE",
			"description": "Enjoy a warm herbal tea. Pause and sip a calming tea like chamomile or ginger."
		},
		{
			"id": "morning_walk",
			"title": "Morning Walk",
			"color": "#CCBCA9",
			"description": "Start your day with a brisk walk. Take a 20-30 minute walk in the morning to boost energy and clear your mind."
		},
		{
			"id": "posture_check",
			"title": "Posture Check",
			"color": "#DBCFA8",
			"description": "Correct your posture throughout the day. Periodically check your alignment: shoulders back, chin parallel to the floor, stomach pulled in."
		},
		{
			"id": "sleep_hygiene",
			"title": "Sleep Hygiene",
			"color": "#BEB5A5",
			"description": "Prepare for restful sleep. Establish a consistent bedtime routine, avoid screens before bed, and ensure a dark, cool room."
		},
		{
			"id": "yoga_practice",
			"title": "Yoga Practice",
			"color": "#CBB6EA",
			"description": "Perform a yoga session. Dedicate time to a yoga practice, focusing on breath, flexibility, and strength."
		},
		{
			"id": "daily_exercise",
			"title": "Daily Exercise",
			"color": "#8DD9CC",
			"description": "Engage in physical activity, ranging from gentle movements like tai chi or bodyweight exercises to more vigorous activities such as cardio, strength training, or recreational sports."
		},
		{
			"id": "healthy_snack",
			"title": "Healthy Snack",
			"color": "#ECCEB4",
			"description": "Choose a nutritious snack. Opt for whole foods like fruits, nuts, or vegetables when you need a light bite."
		},
		{
			"id": "vitamin_intake",
			"title": "Daily Vitamins",
			"color": "#FFDDAD",
			"description": "Take your essential vitamins. Ensure you're taking any prescribed or recommended daily supplements to support overall health."
		}
	],
	"Creativity & Nature Connection": [
		{
			"id": "handmade_crafts",
			"title": "Handmade Crafts",
			"color": "#DBCFB4",
			"description": "Create something with your hands. Knit, sculpt, or sew—engage in tactile creativity."
		},
		{
			"id": "wood_whittling",
			"title": "Wood Whittling",
			"color": "#FFC796",
			"description": "Carve or shape a small piece of wood. Engage in a mindful craft that connects you to natural materials."
		},
		{
			"id": "forest_walk",
			"title": "Forest Walk",
			"color": "#BBD6B0",
			"description": "Take a quiet walk through nature. Immerse yourself in the woods, listen to leaves rustling, and breathe deeply."
		},
		{
			"id": "garden_tending",
			"title": "Garden Tending",
			"color": "#C4DCB5",
			"description": "Spend time nurturing plants. Water your garden, repot a plant, or simply observe the growth around you."
		},
		{
			"id": "soil_touching",
			"title": "Soil Touching",
			"color": "#FFC09F",
			"description": "Feel the earth in your hands. Dig, hold, or move soil to reconnect with nature."
		},
		{
			"id": "sketching_nature",
			"title": "Sketching Nature",
			"color": "#CBBA92",
			"description": "Draw observations from nature. Take a sketchbook outside and draw natural elements like leaves, trees, or landscapes."
		},
		{
			"id": "nature_photography",
			"title": "Nature Photography",
			"color": "#DDC39E",
			"description": "Capture moments in the natural world. Use your camera or phone to photograph landscapes, plants, or animals."
		},
		{
			"id": "identify_plants",
			"title": "Identify Plants",
			"color": "#90C580",
			"description": "Learn about local flora. Use a field guide or app to identify new plants during a walk."
		},
		{
			"id": "soundscape_listening",
			"title": "Soundscape Listening",
			"color": "#E7DDBC",
			"description": "Mindfully listen to natural sounds. Sit quietly outdoors and focus on the sounds of birds, wind, or water."
		},
		{
			"id": "cloud_gazing",
			"title": "Cloud Gazing",
			"color": "#E9D5B4",
			"description": "Observe cloud formations. Lie down and watch the clouds, noticing their shapes and movements."
		}
	],
	"Personal Growth & Learning": [
		{
			"id": "learn_new_word",
			"title": "Learn New Word",
			"color": "#D2C4A7",
			"description": "Expand your vocabulary daily. Look up a new word, understand its meaning, and try to use it in a sentence."
		},
		{
			"id": "read_non_fiction",
			"title": "Read Non-Fiction",
			"color": "#DBC7A1",
			"description": "Engage with informative books. Dedicate time to reading non-fiction books on topics that interest you."
		},
		{
			"id": "online_course",
			"title": "Online Course",
			"color": "#E7B89E",
			"description": "Spend time on an online learning platform. Work on a module or lesson from an online course in a new skill or subject."
		},
		{
			"id": "documentary_watch",
			"title": "Watch Documentary",
			"color": "#B7A58E",
			"description": "Learn something new through a documentary. Choose a documentary on a topic you're curious about and watch it mindfully."
		},
		{
			"id": "skill_practice",
			"title": "Skill Practice",
			"color": "#D9C39E",
			"description": "Practice a new skill for 15 minutes. Dedicate time to actively practice a skill you're trying to develop, like an instrument or coding."
		},
		{
			"id": "listen_podcast",
			"title": "Listen to Podcast",
			"color": "#E7D6B4",
			"description": "Engage with educational audio content. Listen to an informative podcast episode on a topic of interest."
		},
		{
			"id": "problem_solving_puzzle",
			"title": "Problem Solving Puzzle",
			"color": "#C5A692",
			"description": "Challenge your mind with a puzzle. Work on a sudoku, crossword, or logic puzzle to keep your mind sharp."
		},
		{
			"id": "review_goals",
			"title": "Review Goals",
			"color": "#D7C09E",
			"description": "Check in on your long-term objectives. Spend time reviewing your personal goals and planning next steps."
		},
		{
			"id": "try_new_recipe",
			"title": "Try New Recipe",
			"color": "#FFC09F",
			"description": "Experiment with a new dish. Cook or bake something you've never made before to expand your culinary skills."
		},
		{
			"id": "cultural_exploration",
			"title": "Cultural Exploration",
			"color": "#FFD6BD",
			"description": "Learn about a new culture. Explore a new culture through music, art, history, or cuisine."
		}
	],
	"Home & Organization": [
		{
			"id": "declutter_10_min",
			"title": "Declutter 10 Mins",
			"color": "#DDCBB4",
			"description": "Spend 10 minutes tidying a space. Choose a small area and quickly declutter it to maintain order."
		},
		{
			"id": "organize_drawer",
			"title": "Organize a Drawer",
			"color": "#E7DBC4",
			"description": "Tidy one drawer or shelf. Empty, clean, and neatly arrange the contents of a single drawer or shelf."
		},
		{
			"id": "laundry_one_load",
			"title": "Laundry - One Load",
			"color": "#DDC8A1",
			"description": "Do one load of laundry. Start, dry, and put away a single load of laundry to stay on top of chores."
		},
		{
			"id": "meal_prep_mini",
			"title": "Meal Prep Mini",
			"color": "#FFC09F",
			"description": "Prepare a component of a meal. Chop vegetables, cook a grain, or portion out ingredients for future meals."
		},
		{
			"id": "clean_kitchen_sink",
			"title": "Clean Kitchen Sink",
			"color": "#CCBCA9",
			"description": "Wipe down and shine your kitchen sink. Quickly clean and disinfect the kitchen sink after use."
		},
		{
			"id": "make_bed",
			"title": "Make Bed",
			"color": "#E7C6B8",
			"description": "Start your day by making your bed. A simple act of tidiness that can positively impact your morning routine."
		},
		{
			"id": "empty_trash",
			"title": "Empty Trash",
			"color": "#E7DDBC",
			"description": "Empty all small trash cans. Collect and dispose of trash from all bins around the house."
		},
		{
			"id": "plan_next_day",
			"title": "Plan Next Day",
			"color": "#ECCEB4",
			"description": "Outline your tasks for tomorrow. Spend 10-15 minutes at the end of the day planning your schedule and top priorities for the next day."
		},
		{
			"id": "water_houseplants",
			"title": "Water Houseplants",
			"color": "#BEB5A5",
			"description": "Hydrate your indoor plants. Check the soil moisture of your houseplants and water those that need it."
		},
		{
			"id": "quick_sweep",
			"title": "Quick Sweep/Vacuum",
			"color": "#CCBCA9",
			"description": "Maintain cleanliness by quickly tidying the floor in a high-traffic area."
		}
	]
}
